Revit 2027 API
ComputationDataFor3DPathSet.GetCurves Method
 Gets the curves that define the 3D path set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Curve> GetCurves()
Public Function GetCurves As IList(Of Curve)
public:
IList<Curve^>^ GetCurves()
member GetCurves : unit -> IList<Curve>
Return Value
IList<Curve>
 The curves that define the 3D path set.
See Also
Reference
ComputationDataFor3DPathSet Class
Autodesk.Revit.DB.Structure Namespace